sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
/*********************************************************************
 *
 *  Main Application Entry Point and TCP/IP Stack Demo
 *  Module for Microchip TCP/IP Stack
 *   -Demonstrates how to call and use the Microchip TCP/IP stack
 *     -Reference: Microchip TCP/IP Stack Help (TCPIP Stack Help.chm)
 *
 *********************************************************************
 * FileName:        MainDemo.c
 * Dependencies:    TCPIP.h
 * Processor:       PIC18, PIC24F, PIC24H, dsPIC30F, dsPIC33F, PIC32
 * Compiler:        Microchip C32 v1.11b or higher
 *                    Microchip C30 v3.24 or higher
 *                    Microchip C18 v3.36 or higher
 * Company:         Microchip Technology, Inc.
 *
 * Software License Agreement
 *
 * Copyright (C) 2002-2010 Microchip Technology Inc.  All rights
 * reserved.
 *
 * Microchip licenses to you the right to use, modify, copy, and
 * distribute:
 * (i)  the Software when embedded on a Microchip microcontroller or
 *      digital signal controller product ("Device") which is
 *      integrated into Licensee's product; or
 * (ii) ONLY the Software driver source files ENC28J60.c, ENC28J60.h,
 *        ENCX24J600.c and ENCX24J600.h ported to a non-Microchip device
 *        used in conjunction with a Microchip ethernet controller for
 *        the sole purpose of interfacing with the ethernet controller.
 *
 * You should refer to the license agreement accompanying this
 * Software for additional information regarding your rights and
 * obligations.
 *
 * THE SOFTWARE AND DOCUMENTATION ARE PROVIDED "AS IS" WITHOUT
 * WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT
 * LIMITATION, ANY WARRANTY OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL
 * MICROCHIP BE LIABLE FOR ANY INCIDENTAL, SPECIAL, INDIRECT OR
 * CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF
 * PROCUREMENT OF SUBSTITUTE GOODS, TECHNOLOGY OR SERVICES, ANY CLAIMS
 * BY THIRD PARTIES (INCLUDING BUT NOT LIMITED TO ANY DEFENSE
 * THEREOF), ANY CLAIMS FOR INDEMNITY OR CONTRIBUTION, OR OTHER
 * SIMILAR COSTS, WHETHER ASSERTED ON THE BASIS OF CONTRACT, TORT
 * (INCLUDING NEGLIGENCE), BREACH OF WARRANTY, OR OTHERWISE.
 *
 *
 * Author              Date         Comment
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * Nilesh Rajbharti        4/19/01        Original (Rev. 1.0)
 * Nilesh Rajbharti        2/09/02        Cleanup
 * Nilesh Rajbharti        5/22/02        Rev 2.0 (See version.log for detail)
 * Nilesh Rajbharti        7/9/02        Rev 2.1 (See version.log for detail)
 * Nilesh Rajbharti        4/7/03        Rev 2.11.01 (See version log for detail)
 * Howard Schlunder        10/1/04        Beta Rev 0.9 (See version log for detail)
 * Howard Schlunder        10/8/04        Beta Rev 0.9.1 Announce support added
 * Howard Schlunder        11/29/04    Beta Rev 0.9.2 (See version log for detail)
 * Howard Schlunder        2/10/05        Rev 2.5.0
 * Howard Schlunder        1/5/06        Rev 3.00
 * Howard Schlunder        1/18/06        Rev 3.01 ENC28J60 fixes to TCP, 
 *                                    UDP and ENC28J60 files
 * Howard Schlunder        3/01/06        Rev. 3.16 including 16-bit micro support
 * Howard Schlunder        4/12/06        Rev. 3.50 added LCD for Explorer 16
 * Howard Schlunder        6/19/06        Rev. 3.60 finished dsPIC30F support, added PICDEM.net 2 support
 * Howard Schlunder        8/02/06        Rev. 3.75 added beta DNS, NBNS, and HTTP client (GenericTCPClient.c) services
 * Howard Schlunder        12/28/06    Rev. 4.00RC added SMTP, Telnet, substantially modified TCP layer
 * Howard Schlunder        04/09/07    Rev. 4.02 added TCPPerformanceTest, UDPPerformanceTest, Reboot and fixed some bugs
 * Howard Schlunder        xx/xx/07    Rev. 4.03
 * HSchlunder & EWood    08/27/07    Rev. 4.11
 * HSchlunder & EWood    10/08/07    Rev. 4.13
 * HSchlunder & EWood    11/06/07    Rev. 4.16
 * HSchlunder & EWood    11/08/07    Rev. 4.17
 * HSchlunder & EWood    11/12/07    Rev. 4.18
 * HSchlunder & EWood    02/11/08    Rev. 4.19
 * HSchlunder & EWood   04/26/08    Rev. 4.50 Moved most code to other files for clarity
 * KHesky               07/07/08    Added ZG2100-specific support
 * HSchlunder & EWood   07/24/08    Rev. 4.51
 * Howard Schlunder        11/10/08    Rev. 4.55
 * Howard Schlunder        04/14/09    Rev. 5.00
 * Howard Schlunder        07/10/09    Rev. 5.10
 * Howard Schlunder        11/18/09    Rev. 5.20
 * Howard Schlunder        04/28/10    Rev. 5.25
 * Howard Schlunder        10/19/10    Rev. 5.31
 ********************************************************************/
/*
 * This macro uniquely defines this file as the main entry point.
 * There should only be one such definition in the entire project,
 * and this file must define the AppConfig variable as described below.
 */
#define THIS_IS_STACK_APPLICATION
#define USE_PROTOCOL_SERVER

// Include all headers for any enabled TCPIP Stack functions
#include "TCPIP Stack/TCPIP.h"
#include <i2c.h>

#if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
#include "TCPIP Stack/ZeroconfLinkLocal.h"
#endif
#if defined(STACK_USE_ZEROCONF_MDNS_SD)
#include "TCPIP Stack/ZeroconfMulticastDNS.h"
#endif

// Include functions specific to this stack application
#include "MainDemo.h"
#include "TCPIP Stack/SPIRTCSRAM.h"
#include "OCTimer.h"
#include "../protocol.h"
#include "device_control.h"


// Used for Wi-Fi assertions
#define WF_MODULE_NUMBER   WF_MODULE_MAIN_DEMO

// Declare AppConfig structure and some other supporting stack variables
APP_CONFIG AppConfig;

static unsigned short wOriginalAppConfigChecksum;    // Checksum of the ROM defaults for AppConfig
BYTE AN0String[8];
DWORD_VAL CPUSPEED;

extern RR rr1;
extern RR rr2;
extern RR rr3;
extern RAMSaveConfig RRConfigRAM;
// Use UART2 instead of UART1 for stdout (printf functions).  Explorer 16 
// serial port hardware is on PIC UART2 module.
#if defined(EXPLORER_16) || defined(PIC24FJ256DA210_DEV_BOARD)
    int __C30_UART = 2;
#endif


